Revit 2027 API
AdvancedWood.WoodPoreType Property
 The property labeled "Pore type" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodPoreType { get; }
Public Shared ReadOnly Property WoodPoreType As String
	Get
public:
static property String^ WoodPoreType {
	String^ get ();
}
static member WoodPoreType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WoodPoreType".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace